app/Controllers/Absensi.php

SELECT *
FROM `absensi`
---
    public function index()
    {
        $absensi = $this->AbsensiModel->findAll();