app/Controllers/Karyawan.php

    public function get_data()
    {
        return $this->db->get('profil')->result();
---
SELECT *
FROM `profil`