app/Models/AbsensiModel.php

    public function getAbsensi($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
---
SELECT *
FROM `absensi`